Revit 2027 API
TableSectionData.GetCellType Method
Overload List
Name | Description
GetCellType(Int32) |  Returns a column's cell type and if no type exists for this column, it would come from the section
GetCellType(Int32, Int32) |  Returns a cell's Type and if no Type exists for this cell, it would come from the column, or the row, or the section
Top
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace